================================================================================
identifier type
================================================================================
Object result = point.proceed()
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (type_identifier)
    (variable_declarator
      (identifier)
      (method_invocation
        (identifier)
        (identifier)
        (argument_list)))))

================================================================================
primitive type
================================================================================
boolean result = point.proceed()
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (boolean_type)
    (variable_declarator
      (identifier)
      (method_invocation
        (identifier)
        (identifier)
        (argument_list)))))

================================================================================
identifier type with dimension
================================================================================
Object[] args = point.getArgs()
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (declaration_array_type
      (type_identifier)
      (dimensions))
    (variable_declarator
      (identifier)
      (method_invocation
        (identifier)
        (identifier)
        (argument_list)))))

================================================================================
with `as <class>` cast
================================================================================
MethodSignature methodSignature = point.getSignature() as MethodSignature
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (type_identifier)
        (variable_declarator
          (identifier)
          (cast_expression
            (method_invocation
              (identifier)
              (identifier)
              (argument_list))
            (type_identifier)))))

================================================================================
with `(<class>)` cast
================================================================================
MethodSignature methodSignature = (MethodSignature) point.getSignature()
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (type_identifier)
    (variable_declarator
      (identifier)
        (cast_expression
          (type_identifier)
          (method_invocation
            (identifier)
            (identifier)
            (argument_list))))))

================================================================================
positional argument object creation
================================================================================
MyClass myInstance = new MyClass(a,b,c)
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (type_identifier)
    (variable_declarator
      (identifier)
      (object_creation_expression
        (type_identifier)
        (object_creation_argument_list
          (argument
            (identifier))
          (argument
            (identifier))
          (argument
            (identifier)))))))


================================================================================
named argument object creation
================================================================================
MyClass myInstance = new MyClass(a: 1, b: 2, c: 3)
--------------------------------------------------------------------------------
(source_file
  (variable_declaration
    (type_identifier)
    (variable_declarator
      (identifier)
      (object_creation_expression
        (type_identifier)
        (object_creation_argument_list
          (argument
            (identifier)
            (decimal_integer_literal))
          (argument
            (identifier)
            (decimal_integer_literal))
          (argument
            (identifier)
            (decimal_integer_literal)))))))
